type: object
description: The output of any Automox authentication event
properties:
  activity:
    $ref: ./activity.yaml
  activity_id:
    $ref: ./activity_id.yaml
  actor:
    $ref: ./actor.yaml
  auth_protocol_id:
    $ref: ./auth_protocol_id.yaml
  category_uid:
    $ref: ./category_uid.yaml
  class_uid:
    $ref: ./class_uid.yaml
  count:
    $ref: ./count.yaml
  logon_type_id:
    $ref: ./logon_type_id.yaml
  message:
    $ref: ./message.yaml
  metadata:
    $ref: ./metadata.yaml
  severity:
    $ref: ./severity.yaml
  severity_id:
    $ref: ./severity_id.yaml
  status:
    $ref: ./status.yaml
  status_id:
    $ref: ./status_id.yaml
  status_code:
    $ref: ./status_code.yaml
  status_details:
    $ref: ./status_details.yaml
  time:
    $ref: ./time.yaml
  timezone_offset:
    $ref: ./timezone_offset.yaml
  type_name:
    $ref: ./type_name.yaml
  type_uid:
    $ref: ./type_uid.yaml
  user:
    $ref: ./user.yaml
example:
  _id:
    "$oid": 6669d991ba9a2536b8158f17
  activity: Logon
  activity_id: 99
  category_uid: 3
  class_uid: 3002
  count: 1
  message: User Log In Success
  metadata:
    tenant_uid: 7ee9f975-6cb7-44e9-afc3-3adbece95d74
    uid: 9f8896c3-e042-42de-ae41-eaef8a2a667b
    correlation_uid: e92ae537-ea35-42d9-b6d4-92335f91a3db
    product:
      version: 1.0.0-dev
      vendor_name: Automox
    version: 1.1.0
  severity: Informational
  severity_id: 1
  status: Other
  status_code: 200
  status_id: 1
  time: 1718213009419
  timezone_offset: 0
  type_name: 'Authentication: Logon'
  type_uid: 300201
  actor:
    user:
      email_addr: readonly@mailinator.com
      org:
        uid: e92ae537-ea35-42d9-b6d4-92335f91a3db
        name: Automation Testing Zone
      uid: 21968d73-38b9-4c55-8b10-a854a5fa6a36
  user:
    uid: '115998'
    email_addr: readonly@mailinator.com
  auth_protocol_id: 99
  logon_type_id: 99
  status_details: success

