type: object
description: The output for the Web Resource Activity event.
properties:
  activity:
    $ref: ./activity.yaml
  activity_id:
    $ref: ./activity_id.yaml
  category_uid:
    $ref: ./category_uid.yaml
  class_uid:
    $ref: ./class_uid.yaml
  count:
    $ref: ./count.yaml
  message:
    $ref: ./message.yaml
  metadata:
    $ref: ./metadata.yaml
  observables:
    $ref: ./observables.yaml
  raw_data:
    $ref: ./raw_data.yaml
  severity:
    $ref: ./severity.yaml
  severity_id:
    $ref: ./severity_id.yaml
  status_id:
    $ref: ./status_id.yaml
  status_code:
    $ref: ./status_code.yaml
  time:
    $ref: ./time.yaml
  timezone_offset:
    $ref: ./timezone_offset.yaml
  type_name:
    $ref: ./type_name.yaml
  type_uid:
    $ref: ./type_uid.yaml
  web_resources:
    $ref: ./web_resources.yaml
example:
  id: 666b43ee690594387a72f058
  activity: Other
  activity_id: 99
  category_uid: 6
  class_uid: 6001
  count: 1
  message: Manual Device Scan Request
  metadata:
    tenant_uid: 7ee9f975-6cb7-44e9-afc3-3adbece95d74
    uid: b4b222d9-0d71-453d-88ba-f4032f786775
    correlation_uid: 5b45a549-a058-4cce-b194-cbab74ce5476
    product:
      vendor_name: Automox
      version: 1.0.0-dev
    version: 1.1.0
  observables:
  - value: john.doe@automox.com
    name: email
    type_id: 5
    type: Email Address
  - value: 5b45a549-a058-4cce-b194-cbab74ce5476
    type: Organization ID
    type_id: 99
    name: organization.id
  - value: Super Cool Zone
    type_id: 99
    name: organization.name
    type: Organization Name
  raw_data: "{command_type_name=GetOS, server_id=4423039}"
  severity: Informational
  severity_id: 1
  status_code: 201
  status_id: 1
  time: 1718305774191
  timezone_offset: 0
  type_name: 'Web Resources Activity: Other'
  type_uid: 600199
  web_resources:
  - uid: '4423039'
    name: 'Doe-Big-Sur-VM.local custom'
    url_string: https://console.automox.com/api/servers/4423039
    desc: 'Automox Device'
    type: 'Device'

